# IIFCEntityTreeUIServer Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IIFCEntityTreeUIServer Interface
Members See Also
---
The interface used to provide UI on IFC Entity selection.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public interface IIFCEntityTreeUIServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IIFCEntityTreeUIServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IIFCEntityTreeUIServer : IExternalServer
```

# See Also
IIFCEntityTreeUIServer Members
Autodesk.Revit.UI Namespace